{
  "title": {
    "text": "RFC 7289 - Carrier-Grade NAT (CGN) Deployment with BGP/MPLS IP VPNs",
    "ja": "RFC 7289 - BGP / MPLS IP VPNを持つキャリアグレードNAT（CGN）の展開"
  },
  "number": 7289,
  "created_at": "2019-10-31 06:41:19.525792+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                 V. Kuarsingh, Ed.\nRequest for Comments: 7289                                 J. Cianfarani\nCategory: Informational                            Rogers Communications\nISSN: 2070-1721                                                June 2014",
      "raw": true
    },
    {
      "indent": 8,
      "text": "Carrier-Grade NAT (CGN) Deployment with BGP/MPLS IP VPNs",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document specifies a framework to integrate a Network Address Translation (NAT) layer into an operator's network to function as a Carrier-Grade NAT (also known as CGN or Large-Scale NAT). The CGN infrastructure will often form a NAT444 environment as the subscriber home network will likely also maintain a subscriber-side NAT function. Exhaustion of the IPv4 address pool is a major driver compelling some operators to implement CGN. Although operators may wish to deploy IPv6 to strategically overcome IPv4 exhaustion, near-term needs may not be satisfied with an IPv6 deployment alone. This document provides a practical integration model that allows the CGN platform to be integrated into the network, meeting the connectivity needs of the subscriber while being mindful of not disrupting existing services and meeting the technical challenges that CGN brings. The model included in this document utilizes BGP/MPLS IP VPNs, which allow for virtual routing separation, helping ease the CGN's impact on the network. This document does not intend to defend the merits of CGN.",
      "ja": "この文書は（もCGNや大規模NATとして知られている）キャリアグレードNATとして機能するように事業者のネットワークにレイヤネットワークアドレス変換（NAT）を統合するためのフレームワークを指定します。 CGNインフラストラクチャは、多くの場合、おそらくまた、加入者側のNAT機能を維持する加入者ホームネットワークとしてNAT444環境を形成することになります。 IPv4アドレスプールの枯渇は、CGNを実装するためにいくつかの演算子説得力の主要なドライバです。事業者は戦略的にIPv4の枯渇を克服するためにIPv6を導入したい場合がありますが、短期的なニーズだけではIPv6の展開に満足できない場合があります。この文書では、既存のサービスを中断するとCGNがもたらす技術的な課題を満たしていないに留意しながら、加入者の接続ニーズを満たし、CGNプラットフォームはネットワークに統合することを可能にする実用的な統合モデルを提供します。この文書に含まモデルは、ネットワーク上のCGNの影響を和らげる助け、仮想ルーティング分離を可能にBGP / MPLS IP VPNを利用します。この文書では、CGNのメリットを守るつもりはありません。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、情報提供の目的のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 IESGによって承認されていないすべての文書がインターネットStandardのどんなレベルの候補です。 RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7289.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7289で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2014 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2014 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................4\n   1.1. Acronyms and Terms .........................................4\n2. Existing Network Considerations .................................5\n3. CGN Network Deployment Requirements .............................5\n   3.1. Centralized versus Distributed Deployment ..................6\n   3.2. CGN and Traditional IPv4 Service Coexistence ...............7\n   3.3. CGN Bypass .................................................7\n   3.4. Routing Plane Separation ...................................8\n   3.5. Flexible Deployment Options ................................8\n   3.6. IPv4 Overlap Space .........................................9\n   3.7. Transactional Logging for CGN Systems ......................9\n   3.8. Base CGN Requirements ......................................9\n4. BGP/MPLS IP VPN-Based CGN Framework .............................9\n   4.1. Service Separation ........................................11\n   4.2. Internal Service Delivery .................................12\n        4.2.1. Dual-Stack Operation ...............................14\n   4.3. Deployment Flexibility ....................................16\n   4.4. Comparison of BGP/MPLS IP VPN Option versus Other\n        CGN Attachment Options ....................................16\n        4.4.1. Policy-Based Routing ...............................16\n        4.4.2. Traffic Engineering ................................17\n        4.4.3. Multiple Routing Topologies ........................17\n   4.5. Multicast Considerations ..................................17\n5. Experiences ....................................................17\n   5.1. Basic Integration and Requirements Support ................17\n   5.2. Performance ...............................................18\n6. Security Considerations ........................................18\n7. BGP/MPLS IP VPN CGN Framework Discussion .......................18\n8. Acknowledgements ...............................................19\n9. References .....................................................19\n   9.1. Normative Reference .......................................19\n   9.2. Informative References ....................................19",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "Operators are faced with near-term IPv4 address-exhaustion challenges. Many operators may not have a sufficient amount of IPv4 addresses in the future to satisfy the needs of their growing subscriber base. This challenge may also be present before or during an active transition to IPv6, somewhat complicating the overall problem space.",
      "ja": "演算子は、短期のIPv4アドレス枯渇の課題に直面しています。多くの事業者は、彼らの成長の加入者ベースのニーズを満たすために、将来的にIPv4アドレスの十分な量を持っていないかもしれません。この課題はまた、幾分全体問題空間を複雑、IPv6へのアクティブ遷移の前または間に存在してもよいです。"
    },
    {
      "indent": 3,
      "text": "To face this challenge, operators may need to deploy CGN (Carrier-Grade NAT) as described in [RFC6888] to help extend the connectivity matrix once IPv4 address caches run out on the local operator. CGN deployments will most often be added into operator networks that already have active IPv4 and/or IPv6 services.",
      "ja": "この課題に直面するために、事業者は、[RFC6888]で説明したように、IPv4アドレスのキャッシュがローカルオペレータに切れたら、接続行列を延ばすためにCGN（キャリアグレードNAT）をデプロイする必要があるかもしれません。 CGNの展開は、ほとんどの場合、すでに活発なIPv4および/またはIPv6サービスを持っているオペレータのネットワークに追加されます。"
    },
    {
      "indent": 3,
      "text": "The addition of the CGN introduces a translation layer that is controlled and administered by an operator and that should be added in a manner that minimizes disruption to existing services. The CGN system addition may also include interworking in a dual-stack environment where the IPv4 path requires translation.",
      "ja": "CGNの添加を制御および管理オペレータによって、それが既存のサービスの中断を最小限に抑えるように添加されるべきされる変換層を導入します。 CGNシステムのほかにもIPv4のパスが翻訳を必要とするデュアルスタック環境でのインターワーキングを含むことができます。"
    },
    {
      "indent": 3,
      "text": "This document shows how BGP/MPLS IP VPNs as described in [RFC4364] can be used to integrate the CGN infrastructure solving key integration challenges faced by the operator. This model has also been tested and validated in real production-network models and allows fluid operation with existing IPv4 and IPv6 services.",
      "ja": "この文書では、[RFC4364]で説明したようにBGP / MPLS IP VPNは、オペレータが直面する主要な統合の課題を解決するCGNインフラストラクチャを統合するために使用する方法を示しています。また、このモデルは、テストされ、実際の生産ネットワークモデルで検証し、既存のIPv4およびIPv6サービスと流体操作を可能にされています。"
    },
    {
      "indent": 0,
      "text": "1.1. Acronyms and Terms",
      "section_title": true,
      "ja": "1.1。略語と用語"
    },
    {
      "indent": 3,
      "text": "Acronyms and terms used in this document are defined in the list below.",
      "ja": "この文書で使用されている略語や用語を以下のリストで定義されています。"
    },
    {
      "indent": 6,
      "text": "CGN - Carrier-Grade NAT",
      "ja": "CGN  - キャリアグレードNAT"
    },
    {
      "indent": 6,
      "text": "DOCSIS - Data Over Cable Service Interface Specification",
      "ja": "DOCSIS  - データオーバーケーブルサービスインターフェース仕様"
    },
    {
      "indent": 6,
      "text": "CMTS - Cable Modem Termination System",
      "ja": "CMTS  - ケーブルモデム終端システム"
    },
    {
      "indent": 6,
      "text": "DSL - Digital Subscriber Line",
      "ja": "DSL  - デジタル加入者線"
    },
    {
      "indent": 6,
      "text": "BRAS - Broadband Remote Access Server",
      "ja": "BRAS  - ブロードバンドリモートアクセスサーバー"
    },
    {
      "indent": 6,
      "text": "GGSN - Gateway GPRS Support Node",
      "ja": "GGSN  - ゲートウェイGPRSサポートノード"
    },
    {
      "indent": 6,
      "text": "GPRS - General Packet Radio Service",
      "ja": "GPRS  - 汎用パケット無線サービス"
    },
    {
      "indent": 6,
      "text": "ASN-GW - Access Service Network Gateway",
      "ja": "ASN-GW  - アクセスサービスネットワークゲートウェイ"
    },
    {
      "indent": 6,
      "text": "GRT - Global Routing Table",
      "ja": "GRT  - グローバルルーティングテーブル"
    },
    {
      "indent": 6,
      "text": "Internal Realm - Addressing and/or network zone between the Customer Premises Equipment (CPE) and CGN as specified in [RFC6888]",
      "ja": "内部レルム - 顧客宅内機器（CPE）との間のCGNアドレッシング及び/又はネットワークゾーン[RFC6888]で指定されるように"
    },
    {
      "indent": 6,
      "text": "External Realm - Public-side network zone and addressing on the Internet-facing side of the CGN as specified in [RFC6888]",
      "ja": "外部レルム - 公共側のネットワークゾーンと[RFC6888]で指定されたCGNのインターネットに面した側に対処します"
    },
    {
      "indent": 0,
      "text": "2. Existing Network Considerations",
      "section_title": true,
      "ja": "2.既存のネットワークの考慮事項"
    },
    {
      "indent": 3,
      "text": "The selection of CGN may be made by an operator based on a number of factors. The overall driver to use CGN may be the depletion of IPv4 address pools, which leaves little to no addresses for a growing IPv4 service or connection demand growth. IPv6 is considered the strategic answer for IPv4 address depletion; however, the operator may independently decide that CGN is needed to supplement IPv6 and address their particular IPv4 service deployment needs.",
      "ja": "CGNの選択は多くの要因に基づいてオペレータによって製造することができます。 CGNを使用するための全体的なドライバが成長しているIPv4サービスや接続需要の伸びにはアドレスに少しを残したIPv4アドレスプールの枯渇であってもよいです。 IPv6がIPv4アドレスの枯渇のための戦略的な答えと考えられています。しかし、オペレータは、独立CGNがIPv6を補完し、その特定のIPv4サービスの展開ニーズに対応するために必要であることを判断してもよいです。"
    },
    {
      "indent": 3,
      "text": "If the operator has chosen to deploy CGN, they should do this in a manner as not to negatively impact the existing IPv4 or IPv6 subscriber base. This will include solving a number of challenges since subscribers whose connections require translation will have network routing and flow needs that are different from legacy IPv4 connections.",
      "ja": "オペレータがCGNを展開することを選択した場合、それらは負に既存のIPv4またはIPv6加入者ベースに影響を与えないようにしてこれを行うべきです。これは、接続のレガシーIPv4接続異なるネットワークルーティングおよびフローニーズを持つことになります翻訳が必要な加入以来、多くの課題を解決する含まれます。"
    },
    {
      "indent": 0,
      "text": "3. CGN Network Deployment Requirements",
      "section_title": true,
      "ja": "3. CGNネットワーク配置の要件"
    },
    {
      "indent": 3,
      "text": "If a service provider is considering a CGN deployment with a provider NAT44 function, there are a number of basic architectural requirements that are of importance. Preliminary architectural requirements may require all or some of those captured in the list below. Each of the architectural requirement items listed is expanded upon in the following subsections. It should be noted that architectural CGN requirements are additive to base CGN functional requirements contained in [RFC6888]. The assessed architectural requirements for deployment are:",
      "ja": "サービスプロバイダは、プロバイダのNAT44機能付きCGNの展開を検討している場合は、重要である基本的なアーキテクチャ要件がいくつかあります。予備アーキテクチャ要件は、以下のリストに撮影したものの全部または一部を必要とするかもしれません。記載されている建築要件の各項目には以下のサブセクションで上に展開されています。建築CGN要件は[RFC6888]に含まCGN機能要件をベースに添加されていることに留意すべきです。展開のための評価アーキテクチャ要件は以下のとおりです。"
    },
    {
      "indent": 3,
      "text": "- Support distributed (sparse) and centralized (dense) deployment models. See Section 3.1",
      "ja": " - サポート分散（スパース）および集中（密）展開モデル。 3.1節を参照してください。"
    },
    {
      "indent": 3,
      "text": "- Allow coexistence with traditional IPv4-based deployments, which provide global-scoped IPv4 addresses to CPEs. See Section 3.2.",
      "ja": " - のCPEにグローバルスコープのIPv4アドレスを提供し、従来のIPv4ベースの展開、との共存を許可します。 3.2節を参照してください。"
    },
    {
      "indent": 3,
      "text": "- Provide a framework for CGN bypass supporting non-translated flows between endpoints within a provider's network. See Section 3.3.",
      "ja": " - プロバイダのネットワーク内のエンドポイント間の非翻訳フローをサポートCGNバイパスするためのフレームワークを提供します。 3.3節を参照してください。"
    },
    {
      "indent": 3,
      "text": "- Provide a routing framework that allows the segmentation of routing control and forwarding paths between CGN-mediated and non-CGN-mediated flows. See Section 3.4.",
      "ja": " - ルーティング制御とCGN媒介性および非CGNによって媒介される流れとの間のパスの転送のセグメント化を可能にするルーティングフレームワークを提供します。 3.4節を参照してください。"
    },
    {
      "indent": 3,
      "text": "- Provide flexibility for operators to modify their deployments over time as translation demands change (connections, bandwidth, translation realms/zones, and other vectors). See Section 3.5.",
      "ja": " - 翻訳の需要は（接続、帯域幅、翻訳レルム/ゾーン、および他のベクター）を変更として事業者が時間をかけて自分の展開を修正するための柔軟性を提供します。 3.5節を参照してください。"
    },
    {
      "indent": 3,
      "text": "- Flexibility should include integration options for common access technologies such as DSL (BRAS), DOCSIS (CMTS), Mobile (GGSN/PGW/ ASN-GW), and direct Ethernet. See Section 3.5.",
      "ja": " - 柔軟性は、DSL（BRAS）、DOCSIS（CMTS）、モバイル（GGSN / PGW / ASN-GW）、及びダイレクト・イーサネットなどの一般的なアクセス技術のための統合オプションを含むべきです。 3.5節を参照してください。"
    },
    {
      "indent": 3,
      "text": "- Support deployment modes that allow for IPv4 address overlap within the operator's network (between various translation realms or zones). See Section 3.6.",
      "ja": " - （様々な翻訳レルムまたはゾーン間の）オペレータのネットワーク内のIPv4アドレスの重複を可能にするサポート配備モード。セクション3.6を参照してください。"
    },
    {
      "indent": 3,
      "text": "- Allow for evolution to future dual-stack and IPv4/IPv6 transition deployment modes. See Section 3.5.",
      "ja": " - 将来のデュアルスタックとIPv4 / IPv6移行配置モードに進化を可能にします。 3.5節を参照してください。"
    },
    {
      "indent": 3,
      "text": "- Transactional logging and export capabilities to support auxiliary functions, including abuse mitigation. See Section 3.7.",
      "ja": " - 虐待の緩和などの補助機能をサポートするトランザクション・ログおよびエクスポート機能。 3.7節を参照してください。"
    },
    {
      "indent": 3,
      "text": "- Support for stateful connection synchronization between translation instances/elements (redundancy). See Section 3.8.",
      "ja": " - 翻訳インスタンス/要素（冗長性）との間にステートフル接続の同期化をサポートします。 3.8節を参照してください。"
    },
    {
      "indent": 3,
      "text": "- Support for CGN Shared Address Space [RFC6598] deployment modes if applicable. See Section 3.6.",
      "ja": " - 該当する場合CGN共有アドレススペース[RFC6598]の配備モードをサポート。セクション3.6を参照してください。"
    },
    {
      "indent": 3,
      "text": "- Allow for the enablement of CGN functionality (if required) while still minimizing costs and subscriber impact to the best extend possible. See Section 3.8.",
      "ja": " - （必要な場合）、まだ可能な限り最高の拡張にコストと加入者への影響を最小限に抑えながら、CGNの機能の有効化を許可。 3.8節を参照してください。"
    },
    {
      "indent": 3,
      "text": "Other requirements may be assessed on an operator-by-operator basis, but those listed above may be considered for any given deployment architecture.",
      "ja": "他の要件は、オペレータによって、オペレータに基づいて評価することができるが、上記に列挙したものは、任意の所与の配備アーキテクチャのために考慮されてもよいです。"
    },
    {
      "indent": 0,
      "text": "3.1. Centralized versus Distributed Deployment",
      "section_title": true,
      "ja": "3.1。分散型の展開対一元化"
    },
    {
      "indent": 3,
      "text": "Centralized deployments of CGN (longer proximity to end user and/or higher densities of subscribers/connections to CGN instances) differ from distributed deployments of CGN (closer proximity to end user and/or lower densities of subscribers/connections to CGN instances). Service providers may likely deploy CGN translation points more centrally during initial phases if the early system demand is low. Early deployments may see light loading on these new systems since legacy IPv4 services will continue to operate with most endpoints using globally unique IPv4 addresses. Exceptional cases that may drive heavy usage in initial stages may include operators that already translate a significant portion of their IPv4 traffic, operators that may transition to a CGN implementation from legacy translation mechanisms (i.e., traditional firewalls), or operators that build a greenfield deployment that may see quick growth in the number of new IPv4 endpoints that require Internet connectivity.",
      "ja": "CGNの集中展開（より長い近接ユーザおよび/または加入者のより高い密度を終了する/ CGNインスタンスへの接続）が（ユーザ及び/又はCGNインスタンスへの加入者/接続の低い密度を終了する近接）CGNの分散展開異なります。初期のシステム需要が低い場合には、サービスプロバイダは、おそらく初期の段階でより中心CGN翻訳ポイントを展開します。レガシーのIPv4サービスをグローバルにユニークなIPv4アドレスを使用して、ほとんどのエンドポイントで動作し続けますので、初期の展開では、これらの新しいシステムでは軽負荷が表示されます。初期の段階で多用を駆動することができる例外的な場合には、グリーンフィールド展開を構築すでにIPv4トラフィックの大部分を翻訳事業者、事業者、レガシー変換メカニズム（すなわち、従来のファイアウォール）からCGN実装に移行することができる、または事業者を含むことができそれは、インターネット接続を必要とする新しいIPv4のエンドポイントの数の迅速な成長を見ることができます。"
    },
    {
      "indent": 3,
      "text": "Over time, some providers may need to expand and possibly distribute the translation points if demand for the CGN system increases. The extent of the expansion of the CGN infrastructure will depend on factors such as growth in the number of IPv4 endpoints, status of IPv6 content on the Internet, and the overall progress globally to an IPv6-dominate Internet (reducing the demand for IPv4 connectivity). The overall demand for CGN resources will probably follow a bell-like curve with a growth, peak, and decline period.",
      "ja": "時間が経つにつれて、一部のプロバイダは拡大し、おそらくCGNシステムの需要が増加場合、翻訳ポイントを配布する必要があるかもしれません。 CGNインフラストラクチャの拡張の程度は、IPv4のエンドポイント、インターネット上のIPv6コンテンツの状態の数の増加、及び（IPv4接続の需要を減少させる）のIPv6-支配インターネットにグローバル全体の進捗状況などの要因に依存するであろう。 CGNリソースの全体的な需要は、おそらく成長、ピーク、および衰退期にベルのような曲線に従います。"
    },
    {
      "indent": 0,
      "text": "3.2. CGN and Traditional IPv4 Service Coexistence",
      "section_title": true,
      "ja": "3.2。 CGNと従来のIPv4サービスの共存"
    },
    {
      "indent": 3,
      "text": "Newer CGN-serviced endpoints will exist alongside endpoints served by traditional IPv4 globally routed addresses. Operators will need to rationalize these environments since both have distinct forwarding needs. Traditional IPv4 services will likely require (or be best served by) direct forwarding toward Internet peering points while CGN-mediated flows require access to a translator. CGN-mediated and non-CGN-mediated flows pose two fundamentally different forwarding needs.",
      "ja": "新しいCGN-サービスのエンドポイントは、従来のIPv4グローバルルーティングアドレスが提供するエンドポイントと一緒に存在します。オペレータは、両方が別個の転送ニーズを持っているので、これらの環境を合理化する必要があります。 CGN媒介フローは翻訳者へのアクセスを必要としながら、従来のIPv4サービスは、インターネットピアリングポイントに向けて直接転送を可能性が必要になります（または最高で提供すること）。 CGN媒介と非CGN媒介フローは根本的に異なる二つの転送の必要性を提起します。"
    },
    {
      "indent": 3,
      "text": "The new CGN environments should not negatively impact the existing IPv4 service base by forcing all traffic to translation-enabled network points since many flows do not require translation and this would reduce performance of the existing flows. This would also require massive scaling of the CGN, which is a cost and efficiency concern as well.",
      "ja": "多くのフローが翻訳を必要とせず、これは既存のフローのパフォーマンスを低下させるため、新しいCGN環境はマイナス翻訳対応ネットワーク・ポイントへのすべてのトラフィックを強制することにより、既存のIPv4サービス拠点に影響を与えるべきではありません。これも同様にコストと効率関心事であるCGNの大規模なスケーリングを必要とします。"
    },
    {
      "indent": 3,
      "text": "Efficiency of traffic flow and forwarding is considered important since networks are under considerable demand to deliver more and more bandwidth without the luxury of needless inefficiencies that can be introduced with CGN.",
      "ja": "ネットワークはCGNを導入することができ、不要な非効率の豪華させずに、より多くの帯域幅を提供するために、かなりの需要の下にあるので、交通の流れと転送の効率性が重要であると考えられます。"
    },
    {
      "indent": 0,
      "text": "3.3. CGN Bypass",
      "section_title": true,
      "ja": "3.3。 NPAバイパス"
    },
    {
      "indent": 3,
      "text": "The CGN environment is only needed for flows with translation requirements. Many flows that remain within the operator's network do not require translation. Such services include operator-offered DNS services, DHCP services, NTP services, web caching, email, news, and other services that are local to the operator's network.",
      "ja": "CGN環境は翻訳のみ要件のフローのために必要とされます。オペレータのネットワーク内にとどまる多くのフローは、翻訳を必要としません。このようなサービスは、オペレータが提供DNSサービス、DHCPサービス、NTPサービス、Webキャッシング、電子メール、ニュース、および事業者のネットワークにローカルな他のサービスがあります。"
    },
    {
      "indent": 3,
      "text": "The operator may want to leverage opportunities to offer third parties a platform to also provide services without translation. CGN bypass can be accomplished in many ways, but a simplistic, deterministic, and scalable model is preferred.",
      "ja": "オペレータは、第三者にも翻訳せずにサービスを提供するためのプラットフォームを提供する機会を活用することもできます。 CGNバイパスは、多くの方法で達成することができますが、、単純な決定論的、かつスケーラブルなモデルであることが好ましいです。"
    },
    {
      "indent": 0,
      "text": "3.4. Routing Plane Separation",
      "section_title": true,
      "ja": "3.4。ルーティングプレーンの分離"
    },
    {
      "indent": 3,
      "text": "Many operators will want to engineer traffic separately for CGN flows versus flows that are part of the more traditional IPv4 environment. Many times, the routing of these two major flow types differ; therefore, route separation may be required.",
      "ja": "多くのオペレータは、CGNは、より伝統的なIPv4環境の一部であるフロー対フローごとに個別のトラフィックを設計したいと思うでしょう。多くの場合、これらの二つの主要なフロータイプのルーティングは異なります。従って、経路の分離が必要とされ得ます。"
    },
    {
      "indent": 3,
      "text": "Routing-plane separation also allows the operator to utilize other addressing techniques, which may not be feasible on a single routing plane. Such examples include the use of overlapping private address space [RFC1918], Shared Address Space [RFC6598], or other IPv4 space that may overlap globally within the operator's network.",
      "ja": "ルーティング面の分離はまた、オペレータが単一のルーティング面上実現可能ではないかもしれない他のアドレス指定技術を利用することを可能にします。そのような例は、重複プライベートアドレス空間[RFC1918]、共有アドレススペース[RFC6598]、またはオペレータのネットワーク内でグローバルに重なっていてもよい他のIPv4スペースの使用を含みます。"
    },
    {
      "indent": 0,
      "text": "3.5. Flexible Deployment Options",
      "section_title": true,
      "ja": "3.5。柔軟な導入オプション"
    },
    {
      "indent": 3,
      "text": "Service providers operate complex routing environments and offer a variety of IPv4-based services. Many operator environments utilize distributed external routing infrastructures for transit and peering, and these may span large geographical areas. A CGN solution should offer operators the ability to place CGN translation points at various points within their network.",
      "ja": "サービスプロバイダは、複雑なルーティング環境を操作し、IPv4ベースのさまざまなサービスを提供します。多くのオペレータ環境はトランジットとピアリングのための分散外部ルーティングインフラストラクチャを利用し、これらは、大きな地理的領域に及ぶことができます。 CGNソリューションは、事業者は、ネットワーク内の様々なポイントでCGN翻訳ポイントを配置する機能を提供する必要があります。"
    },
    {
      "indent": 3,
      "text": "The CGN deployment should also be flexible enough to change over time as demand for translation services increase or change as noted in [RFC6264]. In turn, the deployment will need to then adapt as translation demand decreases due to the transition of flows to IPv6. Translation points should be able to be placed and moved with as little re-engineering effort as possible, minimizing the risks to the subscriber base.",
      "ja": "CGNの展開も、[RFC6264]で述べたように、翻訳サービスの増加や変更のための需要が時間とともに変化するために十分に柔軟であるべきです。ターンでは、展開はその後、IPv6への流れの移行に伴う翻訳需要が減少するように適応する必要があります。翻訳ポイントを配置し、加入者ベースへのリスクを最小限に、可能な限り少ないリエンジニアリングの努力で移動させることができなければなりません。"
    },
    {
      "indent": 3,
      "text": "Depending on hardware capabilities, security practices, and IPv4 address availability, the translation environments may need to be segmented and/or scaled over time to meet organic IPv4 demand growth. Operators may also want to choose models that support transition to other translation environments such as Dual-Stack Lite (DS-Lite) [RFC6333] and/or Network Address and Protocol Translation from IPv6 Clients to IPv4 Servers (NAT64) [RFC6146]. Operators will want to seek deployment models that are conducive to meeting these goals as well.",
      "ja": "ハードウェア機能、セキュリティ対策、およびIPv4アドレスの可用性に応じて、翻訳環境は、セグメント化および/または有機のIPv4需要の伸びを満たすために時間をかけてスケーリングする必要があるかもしれません。オペレータはまた、IPv4のサーバーへのIPv6クライアントからデュアルスタックライト（DS-Liteの）[RFC6333]および/またはネットワークアドレスとプロトコル変換（NAT64）[RFC6146]などの他の翻訳環境への移行をサポートするモデルを選択することもできます。オペレータは、これらの目標を達成するに資する展開モデルを模索することになるでしょう。"
    },
    {
      "indent": 0,
      "text": "3.6. IPv4 Overlap Space",
      "section_title": true,
      "ja": "3.6。 IPv4のオーバーラップスペース"
    },
    {
      "indent": 3,
      "text": "IPv4 address overlap for CGN translation realms may be required if insufficient IPv4 addresses are available within the operator environment to assign internally unique IPv4 addresses to the CGN subscriber base. The CGN deployment should provide mechanisms to manage IPv4 overlap if required.",
      "ja": "不十分なIPv4アドレスがCGNの加入者ベースの内部にユニークなIPv4アドレスを割り当てるためにオペレータ環境内で利用可能である場合CGN翻訳レルムのIPv4アドレス重複が必要とされ得ます。 CGNの展開は、必要に応じて、IPv4のオーバーラップを管理するためのメカニズムを提供する必要があります。"
    },
    {
      "indent": 0,
      "text": "3.7. Transactional Logging for CGN Systems",
      "section_title": true,
      "ja": "3.7。 CGNシステムのトランザクションログ"
    },
    {
      "indent": 3,
      "text": "CGNs may require transactional logging since the source IP and related transport-protocol information are not easily visible to external hosts and system.",
      "ja": "ソースIPと関連するトランスポートプロトコル情報が容易に外部ホストとシステムに見えないので、CGNを、トランザクションログを必要とするかもしれません。"
    },
    {
      "indent": 3,
      "text": "If needed, CGN systems should be able to generate logs that identify internal-realm host parameters (i.e., IP/Port) and associate them to external-realm parameters imposed by the translator. The logged information should be stored on the CGN hardware and/or exported to another system for processing. The operator may choose to also enable mechanisms to help reduce logging, such as block allocation of UDP and TCP ports or deterministic translation options, e.g., [CGN-DEPLOYMENTS].",
      "ja": "必要な場合は、CGNシステムは、内部のレルムのホストパラメータ（すなわち、IP /ポート）を特定し、翻訳者によって課せられた外部レルムパラメータにそれらを関連付けるログを生成することができるはずです。ログイン情報は、CGNハードウェアに保存されたおよび/または処理のために別のシステムにエクスポートされるべきです。オペレータはまた、UDPのブロック割り当てとTCPポートまたは決定論的変換オプション、例えば、[CGN-展開]として、ログを軽減するためのメカニズムを可能にするために選択することができます。"
    },
    {
      "indent": 3,
      "text": "Operators may be legally obligated to keep track of translation information. The operator may need to utilize their standard practices in handling sensitive customer data when storing and/or transporting such data. Further information regarding CGN logging requirements can be found in Section 4 of [RFC6888].",
      "ja": "オペレータは法的に変換情報を追跡する義務することができます。オペレータは、保存および/またはそのようなデータを転送するときに顧客の機密データを扱うには彼らの標準慣行を利用する必要があるかもしれません。 CGNロギング要件に関するさらなる情報は、[RFC6888]のセクション4に見出すことができます。"
    },
    {
      "indent": 0,
      "text": "3.8. Base CGN Requirements",
      "section_title": true,
      "ja": "3.8。基本CGNの要件"
    },
    {
      "indent": 3,
      "text": "Whereas the requirements above represent assessed architectural requirements, the CGN platform will also need to meet the base CGN requirements of a CGN function. Base requirements include functions such as Bulk Port Allocation and other CGN device-specific functions. These base CGN platform requirements are captured in [RFC6888].",
      "ja": "上記の要件を評価アーキテクチャ要件を表し、一方、CGNプラットフォームは、CGN機能のベースCGNの要件を満たす必要があります。ベース要件は、バルクポート割り当て及び他のCGN装置固有の機能などの機能を含みます。これら塩基CGNプラットフォーム要件は[RFC6888]に捕捉されます。"
    },
    {
      "indent": 0,
      "text": "4. BGP/MPLS IP VPN-Based CGN Framework",
      "section_title": true,
      "ja": "4. BGP / MPLS IP VPNベースのCGNフレームワーク"
    },
    {
      "indent": 3,
      "text": "The BGP/MPLS IP VPN [RFC4364] framework for CGN segregates the internal realms within the service-provider space into Layer 3 MPLS-based VPNs. The operator can deploy a single realm for all CGN-based flows or can deploy multiple realms based on translation demand and other factors such as geographical proximity. A realm in this model refers to a \"VPN\", which shares a unique Route Distinguisher / Route Target (RD/RT) combination, routing plane, and forwarding behaviors.",
      "ja": "CGNのためのBGP / MPLS VPN IP [RFC4364]のフレームワークは、レイヤ3 MPLSベースのVPNにサービスプロバイダー空間内の内部レルムを分離します。オペレータは、すべてのCGNベースのフローのための単一の領域を展開することができ、または翻訳の需要や、地理的近接度などの他の要因に基づいて、複数のレルムを展開することができます。このモデルにおける領域は、固有のルート区分/ルートターゲット（RD / RT）の組合せ、ルーティング面、及び転送動作を共有する、「VPN」を指します。"
    },
    {
      "indent": 3,
      "text": "The BGP/MPLS IP VPN infrastructure provides control-plane and forwarding separation for the traditional IPv4 service environment and CGN environment(s). The separation allows for routing information (such as default routes) to be propagated separately for CGN-based and non-CGN-based subscriber flows. Traffic can be efficiently routed to the Internet for normal flows and routed directly to translators for CGN-mediated flows. Although many operators may run a \"default-route-free\" core, IPv4 flows that require translation must obviously be routed first to a translator, so a default route is acceptable for the internal realms.",
      "ja": "BGP / MPLS IP VPNインフラストラクチャは、制御プレーンと従来のIPv4サービス環境とCGN環境（複数可）の転送の分離を提供します。分離は、CGNベースおよび非CGNベース加入者フローについて別々に伝播する（例えば、デフォルトルートのような）情報をルーティングすることを可能にします。トラフィックが効率的に通常のフローのためにインターネットにルーティングされ、CGN媒介フローの翻訳者に直接ルーティングすることができます。多くのオペレータは、「デフォルトルートのない」コアを実行するかもしれないが、翻訳が必要なのIPv4フローは明らかに翻訳者に最初にルーティングされなければならないので、デフォルトのルートは、内部のレルムのために許容可能です。"
    },
    {
      "indent": 3,
      "text": "The physical location of the Virtual Routing and Forwarding (VRF) termination point for a BGP/MPLS IP VPN-enabled CGN can vary and be located anywhere within the operator's network. This model fully virtualizes the translation service from the base IPv4 forwarding environment that will likely be carrying Internet-bound traffic. The base IPv4 environment can continue to service traditional IPv4 subscriber flows plus post translated CGN flows.",
      "ja": "BGP / MPLS IP VPN対応CGNの仮想ルーティングおよび転送（VRF）終端点の物理的な位置を変えることができ、どこにでもオペレータのネットワーク内に配置すること。このモデルは、完全に可能性の高いインターネットバウンドトラフィックを伝送されるベースのIPv4フォワーディング環境から翻訳サービスを仮想化します。ベースIPv4環境は、従来のIPv4加入者のフローにサービスを提供し続けることができますプラスポストは、CGNが流れて翻訳しました。"
    },
    {
      "indent": 3,
      "text": "Figure 1 provides a view of the basic model. The access node provides CPE access to either the CGN VRF or the Global Routing Table (GRT), depending on whether the subscriber receives a private or public IP. Translator-mediated traffic follows an MPLS Label Switched Path (LSP) that can be set up dynamically and can span one hop or many hops (with no need for complex routing policies). Traffic is then forwarded to the translator, which can be an external appliance or integrated into the VRF Termination (Provider Edge) router. Once traffic is translated, it is forwarded to the GRT for general Internet forwarding. The GRT can also be a separate VRF (Internet access VPN/VRF) should the provider choose to implement their Internet-based services in that fashion. The translation services are effectively overlaid onto the network but are maintained within a separate forwarding and control plane.",
      "ja": "図1は、基本的なモデルのビューを提供します。アクセスノードは、加入者がプライベートまたはパブリックIPを受信したか否かに応じて、CGN VRFまたはグローバル・ルーティングテーブル（GRT）のいずれかへのCPEへのアクセスを提供します。翻訳媒介トラフィックを動的に設定することができ、1つのホップまたは（複雑なルーティングポリシーを必要とせず、）多くのホップをまたがることができるMPLSラベルスイッチパス（LSP）を次の。トラフィックは、外部機器やVRF終了（プロバイダーエッジ）ルータに統合することができます翻訳者に転送されます。トラフィックが変換されると、それは一般的なインターネットの転送のためにGRTに転送されます。プロバイダはそのやり方で自分のインターネットベースのサービスを実装するために選択する必要がありGRTも別々のVRF（インターネットVPN / VRF）することができます。翻訳サービスを効果的にネットワーク上にオーバーレイされているが、別々の転送と制御プレーン内に維持されます。"
    },
    {
      "indent": 9,
      "text": "          Access Node     VRF Termination        CGN\n         +-----------+     +-----------+    +-----------+\n         |           |     |           |    |           |\n CPE     | +-------+ |     | +-------+ |    | +-------+ |\n+----+   | |       | | LSP | |       | | IP | |       | |\n|  --+---+-+->VRF--+-+-----+-+->VRF--+-+----+-+->     | |\n+----+   | |       | |     | |       | |    | |       | |\n         | +-------+ |     | +-------+ |    | |       | |\n         |           |     |           |    | | XLATE | |\n         |           |     |           |    | |       | |\nCPE-CGN  | +-------+ |     | +-------+ |    | |       | |\n+----+   | |       | |     | |       | | IP | |       | |\n|  --+---+-+->GRT  | |     | |  GRT<-+-+----+-+--     | |\n+----+   | |   |   | |     | |   |   | |    | |       | |\n         | +---+---+ |     | +---+---+ |    | +-------+ |\n         +-----+-----+     +-----+-----+    +-----------+\n               |                 |\n               |                 |                IPv4\n               |                 |   IP       +---------+\n               |                 +------------+->       |\n               |                     IP       |    GRT  |\n               +------------------------------+->       |\n                                              +---------+",
      "raw": true
    },
    {
      "indent": 17,
      "text": "Figure 1: Basic BGP/MPLS IP VPN CGN Model",
      "ja": "図1：基本的なBGP / MPLS IP VPN CGNモデル"
    },
    {
      "indent": 3,
      "text": "If more then one VRF (translation realm) is used within the operator's network, each VPN instance can manage CGN flows independently for the respective realm. The described architecture does not prescribe a single redundancy model that ensures network availability as a result of CGN failure. Deployments are able to select a redundancy model that fits best with their network design. If state information needs to be passed or maintained between hardware instances, the vendor would need to enable this feature in a suitable manner.",
      "ja": "もっとして1つのVRF（翻訳領域）はオペレータのネットワーク内で使用されている場合は、各VPNのインスタンスは、CGNは、それぞれの分野ごとに独立フローを管理することができます。記載アーキテクチャはCGNの失敗の結果として、ネットワークの可用性を保証する単一の冗長性モデルを規定していません。展開では、ネットワークの設計と最高のフィット冗長モデルを選択することができます。状態情報が渡されたか、ハードウェアのインスタンス間で維持する必要がある場合、ベンダーは、適切な方法で、この機能を有効にする必要があります。"
    },
    {
      "indent": 0,
      "text": "4.1. Service Separation",
      "section_title": true,
      "ja": "4.1。サービスの分離"
    },
    {
      "indent": 3,
      "text": "The MPLS/VPN CGN framework supports route separation. The traditional IPv4 flows can be separated at the access node (initial Layer 3 service point) from those that require translation. This type of service separation is possible on common technologies used for Internet access within many operator networks. Service separation can be accomplished on common access technology, including those used for DOCSIS (CMTS), Ethernet access, DSL (BRAS), and mobile access (GGSN/ASN-GW) architectures.",
      "ja": "MPLS / VPN CGNフレームワークは、ルートの分離をサポートしています。従来のIPv4フローは、翻訳を必要とするものからアクセス・ノード（最初のレイヤ3のサービスポイント）で分離することができます。サービスの分離のこのタイプは、多くの事業者のネットワーク内のインターネットアクセスのために使用される一般的な技術で可能です。サービス分離はDOCSIS（CMTS）、イーサネット（登録商標）アクセス、DSL（BRAS）、およびモバイルアクセス（GGSN / ASN-GW）アーキテクチャで使用されるものを含む、一般的なアクセス技術で達成することができます。"
    },
    {
      "indent": 0,
      "text": "4.2. Internal Service Delivery",
      "section_title": true,
      "ja": "4.2。内部サービスデリバリ"
    },
    {
      "indent": 3,
      "text": "Internal services can be delivered directly to the privately addressed endpoint within the CGN domain without translation. This can be accomplished in one of two methods. The first method is the use of \"route leaking\", a method of exchanging routes between the CGN VRF and GRT; this method may also include reducing the overall number of VRFs in the system and exposing services in the GRT. The second method, which is described in detail within this section, is the use of a Services VRF. The second model is a more traditional extranet services model but requires more system resources to implement.",
      "ja": "内部サービスは、個人的に翻訳することなく、CGNドメイン内のエンドポイントを取り上げに直接配信することができます。これは、2つの方法のいずれかで達成することができます。最初の方法は、「ルート漏れ」、CGN VRFとGRT間のルートを交換する方法を使用することです。この方法は、システム内のVRFの全体数を減らすとGRTでサービスを露出含むことができます。このセクション内で詳細に記載されている第二の方法は、サービスVRFの使用です。第2のモデルは、より伝統的なエクストラネットサービスモデルですが、実装には、多くのシステムリソースを必要とします。"
    },
    {
      "indent": 3,
      "text": "Using direct route exchange (import/export) between the CGN VRFs and the Services VRFs creates reachability using the aforementioned extranet model available in the BGP/MPLS IP VPN structure. This model allows the provider to maintain separate forwarding rules for translated flows, which require a pass through the translator to reach external network entities, versus those flows that need to access internal services. This operational detail can be advantageous for a number of reasons, such as service-access policies and endpoint identification. First, the provider can reduce the load on the translator since internal services do not need to be factored into the scaling of the CGN hardware (which may be quite large). Second, more direct forwarding paths can be maintained to provide better network efficiency. Third, geographic locations of the translators and the services infrastructure can be deployed in locations in an independent manner. Additionally, the operator can allow CGN subject endpoints to be accessible via an untranslated path, reducing the complexities of provider-initiated management flows. This last point is of key interest since NAT removes transparency to the end device in normal cases.",
      "ja": "CGNのVRFとサービスのVRFの間の直接経路交換（インポート/エクスポート）を使用すると、BGP / MPLS IP VPN構造で使用可能な上述のエクストラネットモデルを用いて到達可能性を作成します。このモデルは、プロバイダが内部サービスにアクセスする必要がこれらのフローに対して、外部のネットワークエンティティに到達するために翻訳通過を必要と翻訳されたフローのための独立した転送ルールを維持することができます。この動作詳細は、サービス・アクセス・ポリシーおよびエンドポイント識別などの理由から、多くのために有利であり得ます。内部サービスは、（非常に大きくなる場合があります）CGNハードウェアのスケーリングに織り込まする必要はありませんので、まず、プロバイダは、翻訳者の負荷を軽減することができます。第二の、より直接的な転送パスは、より良いネットワーク効率を提供するように維持することができます。翻訳者とサービスインフラストラクチャの第三に、地理的位置は独立した形での場所に展開することができます。また、オペレータは、CGN対象エンドポイントはプロバイダ開始管理フローの複雑さを低減する、非翻訳パスを介してアクセスすることを可能にすることができます。 NATは、通常のケースではエンドデバイスへの透明性を取り除くため、この最後の点は重要な関心事です。"
    },
    {
      "indent": 3,
      "text": "Figure 2 below shows how internal services are provided untranslated since flows are sent directly from the access node to the services node/VRF via an MPLS LSP. This traffic is not forwarded to the CGN translator and therefore is not subject to problematic behaviors related to NAT. The Services VRF contains routing information that can be \"imported\" into the access node VRF, and the CGN VRF routing information can be \"imported\" into the Services VRF.",
      "ja": "図2は、以下のフローはMPLS LSPを介してサービスノード/ VRFへのアクセスノードから直接送信されているため非翻訳提供される方法を内部サービス示します。このトラフィックは、CGNトランスレータに転送されないため、NATに関連した問題行動の対象ではありません。サービスVRFは、アクセスノードVRFに「インポート」することができ、かつCGN VRFルーティング情報は、サービスのVRFに「インポート」することができ、ルーティング情報を含んでいます。"
    },
    {
      "indent": 3,
      "text": "           Access Node     VRF Termination     CGN\n         +-------------+    +-----------+  +----------+\n         |             |    |           |  |          |\n  CPE    | +---------+ |    | +-------+ |  | +------+ |\n+-----+  | |         | |    | |       | |  | |      | |\n|   --+--+-+-> VRF --+-+--+ | |  VRF  | |  | |      | |\n+-----+  | |         | |  | | |       | |  | |      | |\n         | +---------+ |  | | +-------+ |  | |      | |\n         |             |  | |           |  | |XLATE | |\n         |             |  | |           |  | |      | |\nCPE-CGN  | +---------+ |  | | +-------+ |  | |      | |\n+-----+  | |         | |  | | |       | |  | |      | |\n|   --+--+-+-> GRT   | |  | | |  GRT  | |  | |      | |\n+-----+  | |    |    | |  | | |       | |  | |      | |\n         | +----+----+ |  | | +-------+ |  | +------+ |\n         +------+------+  | +-----------+  +----------+\n                |         |\n                |         |                    IPv4\n                |         |               +-----------+\n                |         +---------------+->Services |\n                |                         |    VRF    |\n                .-------------------------+->   |     |\n                                          +-----+-----+\n                                                |\n                                          +-----V-----+\n                                          |           |\n                                          |   Local   |\n                                          |  Content  |\n                                          +-----------+",
      "raw": true
    },
    {
      "indent": 16,
      "text": "Figure 2: Internal Services and CGN Bypass",
      "ja": "図2：内部サービスとCGNバイパス"
    },
    {
      "indent": 3,
      "text": "An extension to the services delivery LSP is the ability to also provide direct subscriber-to-subscriber traffic flows between CGN zones. Each zone or realm may be fitted with separate CGN resources, but the subtending subscribers don't necessarily need to be mediated (translated) by the CGN translators. This option, as shown in Figure 3, is easy to implement and can only be enabled if no IPv4 address overlap is used between communicating CGN zones.",
      "ja": "サービス配信LSPへの拡張は、直接加入者に加入者のトラフィックがCGNゾーンとの間を流れる提供する能力です。各ゾーンまたはレルムは別々のCGN資源を装着してもよいが、内在する加入者は必ずしもCGNの翻訳者（翻訳）仲介する必要はありません。このオプションは、図3に示すように、実装が容易であり、何らのIPv4アドレス重複がCGNゾーンの通信との間で使用されていない場合にのみ有効にすることができます。"
    },
    {
      "indent": 3,
      "text": "          Access Node-1     VRF Termination   CGN-1\n         +-------------+    +-----------+  +----------+\n         |             |    |           |  |          |\n  CPE-1  | +---------+ |    | +-------+ |  | +------+ |\n+-----+  | |         | |    | |       | |  | |      | |\n|   --+--+-+-  VRF --+-+-+  | |  VRF  | |  | |      | |\n+-----+  | |         | | |  | |       | |  | |      | |\n         | +---------+ | |  | +-------+ |  | |      | |\n         |             | |  |           |  | |XLATE | |\n         |             | |  |           |  | |      | |\nCPE-2-CGN| +---------+ | |  | +-------+ |  | |      | |\n+-----+  | |         | | |  | |       | |  | |      | |\n|   --+--+-+-  GRT   | | |  | |  GRT  | |  | |      | |\n+-----+  | |         | | |  | |       | |  | |      | |\n         | +---------+ | |  | +-------+ |  | +------+ |\n         +-------------+ |  +-----------+  +----------+\n                         |\n                     LSP |\n                         |\n          Access Node-2  |  VRF Termination   CGN-2\n         +-------------+ |  +-----------+  +----------+\n         |             | |  |           |  |          |\nCPE-3-CGN| +---------+ | |  | +-------+ |  | +------+ |\n+-----+  | |         | | |  | |       | |  | |      | |\n|   --+--+-+-- VRF --+-+-+  | |  VRF  | |  | |      | |\n+-----+  | |         | |    | |       | |  | |      | |\n         | +---------+ |    | +-------+ |  | |      | |\n         |             |    |           |  | |XLATE | |\n         |             |    |           |  | |      | |\n  CPE-4  | +---------+ |    | +-------+ |  | |      | |\n+-----+  | |         | |    | |       | |  | |      | |\n|   --+--+-+-  GRT   | |    | |  GRT  | |  | |      | |\n+-----+  | |         | |    | |       | |  | |      | |\n         | +---------+ |    | +-------+ |  | +------+ |\n         +-------------+    +-----------+  +----------+",
      "raw": true
    },
    {
      "indent": 15,
      "text": "Figure 3: Subscriber-to-Subscriber CGN Bypass",
      "ja": "図3：加入者対加入者CGNバイパス"
    },
    {
      "indent": 3,
      "text": "The inherent capabilities of the BGP/MPLS IP VPN model demonstrates the ability to offer CGN bypass in a standard and deterministic manner without the need of policy-based routing or traffic engineering.",
      "ja": "BGP / MPLS IP VPNモデルの本来の機能は、ポリシーベースルーティングやトラフィックエンジニアリングを必要とせずに、標準と決定論的にCGNバイパスを提供する能力を示しています。"
    },
    {
      "indent": 0,
      "text": "4.2.1. Dual-Stack Operation",
      "section_title": true,
      "ja": "4.2.1。デュアルスタック操作"
    },
    {
      "indent": 3,
      "text": "The BGP/MPLS IP VPN CGN model can also be used in conjunction with IPv4/IPv6 dual-stack service modes. Since many providers will use CGNs on an interim basis while IPv6 matures within the global",
      "ja": "BGP / MPLS IP VPN CGNのモデルは、IPv4 / IPv6デュアルスタックサービスモードと組み合わせて使用​​することができます。 IPv6はグローバル内で成熟しながら、多くのプロバイダは、暫定的にCGNを使用しますので、"
    },
    {
      "indent": 3,
      "text": "Internet or due to technical constraints, a dual-stack option is of strategic importance. Operators can offer this dual-stack service for both traditional IPv4 (global IP) endpoints and CGN-mediated endpoints.",
      "ja": "インターネットや技術的な制約のために、デュアルスタックオプションは、戦略的に重要です。オペレータは、従来のIPv4（グローバルIP）エンドポイントとCGN媒介エンドポイントの両方のために、このデュアルスタックサービスを提供することができます。"
    },
    {
      "indent": 3,
      "text": "Operators can separate the IP flows for IPv4 and IPv6 traffic, or they can use other routing techniques to move IPv6-based flows toward the GRT (Global Routing Table) while allowing IPv4 flows to remain within the IPv4 CGN VRF for translator services.",
      "ja": "オペレータは、IPは、IPv4およびIPv6トラフィックに対して流れる分離することができ、またはそれらは、IPv4が翻訳サービスのためのIPv4 CGN VRF内に留まるために流れるせながらGRT（グローバルルーティングテーブル）に向かってIPv6ベースのフローを移動する他のルーティング技術を使用することができます。"
    },
    {
      "indent": 3,
      "text": "Figure 4 shows how IPv4 translation services can be provided alongside IPv6-based services. This model allows the provider to enable CGN to manage IPv4 flows (translated), and IPv6 flows are routed without translation efficiently toward the Internet. Once again, forwarding of flows to the translator does not impact IPv6 flows, which do not require this service.",
      "ja": "図4は、IPv4の翻訳サービスは、IPv6ベースのサービスと一緒に提供することができる方法を示しています。このモデルは、（翻訳）のIPv4フローを管理するために、CGNを可能にするために、プロバイダを可能にし、IPv6のフローは、インターネットに向かって効率的に変換されずにルーティングされます。もう一度、翻訳者へのフローの転送は、このサービスを必要としないIPv6の流れを、影響しません。"
    },
    {
      "indent": 3,
      "text": "          Access Node   VRF Termination        CGN\n         +-----------+   +-----------+    +-----------+\n         |           |   |           |    |           |\n CPE-CG  | +-------+ |   | +-------+ |    | +-------+ |\n+-----+  | |       | |LSP| |       | | IP | |       | |\n|   --+--+-+->VRF--+-+---+-+->VRF--+-+----+-+>      | |\n|IPv4 |  | |       | |   | |       | |    | |       | |\n|     |  | +-------+ |   | +-------+ |    | |       | |\n+-----|  |           |   |           |    | | XLATE | |\n|IPv6 |  |           |   |           |    | |       | |\n|     |  | +-------+ |   | +-------+ |    | |       | |\n|     |  | |  IPv6 | |   | |  IPv4 | | IP | |       | |\n|   --+--+-+->GRT  | |   | |  GRT<-+-+----+-+--     | |\n+-----+  | |   |   | |   | |   |   | |    | |       | |\n         | +---+---+ |   | +---+---+ |    | +-------+ |\n         +-----+-----+   +-----+-----+    +-----------+\n               |               |\n               |               |          +-----------+\n               |               |    IP    |    IPv4   |\n               |               +----------+->  GRT    |\n               |                          +-----------+\n               |\n               |\n               |\n               |               IP         +-----------+\n               +--------------------------+->  IPv6   |\n                                          |    GRT    |\n                                          +-----------+",
      "raw": true
    },
    {
      "indent": 15,
      "text": "Figure 4: CGN with IPv6 Dual-Stack Operation",
      "ja": "図4：IPv6のデュアルスタック操作でCGN"
    },
    {
      "indent": 0,
      "text": "4.3. Deployment Flexibility",
      "section_title": true,
      "ja": "4.3。展開の柔軟性"
    },
    {
      "indent": 3,
      "text": "The CGN translator services can be moved, separated or segmented (new translation realms) without the need to change the overall translation design. Since dynamic LSPs are used to forward traffic from the access nodes to the translation points, the physical location of the VRF termination points can vary and be changed easily.",
      "ja": "CGNの翻訳サービスは、全体的な翻訳の設計を変更することなく、移動分離またはセグメント（新しい翻訳レルム）することができます。ダイナミックのLSPを翻訳ポイントにアクセスノードからのトラフィックを転送するために使用されるので、VRFターミネーションポイントの物理的位置を変えることができ、容易に変更すること。"
    },
    {
      "indent": 3,
      "text": "This type of flexibility allows the service provider to initially deploy more centralized translation services based on relatively low loading factors and distribute the translation points over time to improve network-traffic efficiencies and support higher translation load.",
      "ja": "柔軟性のこのタイプは、サービスプロバイダが、最初は比較的低負荷の要因に基づいて、より集中翻訳サービスを展開し、ネットワーク・トラフィックの効率を改善し、高い翻訳の負荷をサポートするために、時間をかけて翻訳ポイントを配布することができます。"
    },
    {
      "indent": 3,
      "text": "Although traffic-engineered paths are not required within the MPLS/ VPN deployment model, nothing precludes an operator from using technologies like MPLS with Traffic Engineering [RFC3031]. Additional routing mechanisms can be used as desired by the provider and can be seen as independent. There is no specific need to diversify the existing infrastructure in most cases.",
      "ja": "トラフィックエンジニアリングパスがMPLS / VPNの展開モデル内で必要とされていませんが、何もトラフィックエンジニアリング[RFC3031]でMPLSなどの技術を使用してから作業を排除していません。プロバイダによって所望の独立したと見ることができるように追加のルーティング・メカニズムを使用することができます。ほとんどの場合、既存のインフラを多様化する特段の必要はありません。"
    },
    {
      "indent": 0,
      "text": "4.4. Comparison of BGP/MPLS IP VPN Option versus Other CGN Attachment Options",
      "ja": "4.4。その他CGN添付オプション対BGP / MPLS IP VPNオプションの比較"
    },
    {
      "indent": 3,
      "text": "Other integration architecture options exist that can attach CGN based service flows to a translator instance. Alternate options that can be used to attach such services include:",
      "ja": "その他の統合アーキテクチャのオプションは、CGNを添付することができますベースのサービスは、翻訳者インスタンスに流れが存在します。このようなサービスを取り付けるために使用することができます代替オプションは、次のとおりです。"
    },
    {
      "indent": 3,
      "text": "- policy-based routing (static) to direct translation-bound traffic to a network-based translator;",
      "ja": " - ネットワークベースの翻訳者への直接翻訳バウンドトラフィックにポリシーベースルーティング（スタティック）。"
    },
    {
      "indent": 3,
      "text": "- traffic engineering; and",
      "ja": " - トラフィックエンジニアリング;そして"
    },
    {
      "indent": 3,
      "text": "- multiple routing topologies.",
      "ja": " - 複数のルーティングトポロジ。"
    },
    {
      "indent": 0,
      "text": "4.4.1. Policy-Based Routing",
      "section_title": true,
      "ja": "4.4.1。ポリシーベースルーティング"
    },
    {
      "indent": 3,
      "text": "Policy-based routing (PBR) provides another option to direct CGN-mediated flows to a translator. PBR options, although possible, are difficult to maintain (due to static policy) and must be configured throughout the network with considerable maintenance overhead.",
      "ja": "ポリシーベースルーティング（PBR）は、翻訳者にCGN媒介の流れを指示する別のオプションを提供します。 PBRオプションは、可能なものの、（静的ポリシーに起因する）を維持することが困難であり、かなりのメンテナンスオーバーヘッドとネットワーク全体構成されなければなりません。"
    },
    {
      "indent": 3,
      "text": "More centralized deployments may be difficult or too onerous to deploy using policy-based routing methods. Policy-based routing would not achieve route separation (unless used with others options) and may add complexities to the providers' routing environment.",
      "ja": "より集中配備は、ポリシーベースのルーティング方法を使用して展開することが困難または過度に面倒であってもよいです。ポリシーベースルーティングは（他のオプションと一緒に使用しない限り）ルートの分離を達成できないだろうとプロバイダのルーティング環境に複雑さを追加することができます。"
    },
    {
      "indent": 0,
      "text": "4.4.2. Traffic Engineering",
      "section_title": true,
      "ja": "4.4.2。トラフィックエンジニアリング"
    },
    {
      "indent": 3,
      "text": "Traffic engineering can also be used to direct traffic from an access node toward a translator. Traffic engineering, like MPLS-TE, may be difficult to set up and maintain. Traffic engineering provides additional benefits if used with MPLS by adding potential for faster path re-convergence. Traffic engineering paths would need to be updated and redefined over time as CGN translation points are augmented or moved.",
      "ja": "トラフィックエンジニアリングはまた、翻訳者の方へアクセス・ノードからのトラフィックを誘導するために使用することができます。トラフィックエンジニアリングは、MPLS-TEのように、セットアップおよび維持することは困難です。速いパスの再収束の可能性を追加することにより、MPLSを使用した場合、トラフィックエンジニアリングは、追加の利点を提供します。 CGN翻訳ポイントが増大したり移動されるトラフィックエンジニアリングパスは、時間の経過とともに更新され、再定義する必要があります。"
    },
    {
      "indent": 0,
      "text": "4.4.3. Multiple Routing Topologies",
      "section_title": true,
      "ja": "4.4.3。複数のルーティングトポロジ"
    },
    {
      "indent": 3,
      "text": "Multiple routing topologies can be used to direct CGN-based flows to translators. This option would achieve the same basic goal as the MPLS/VPN option but with additional implementation overhead and platform configuration complexity. Since operator based translation is expected to have an unknown lifecycle, and may see various degrees of demand (dependent on operator IPv4 Global space availability and shift of traffic to IPv6), it may be too large of an undertaking for the provider to enabled this as their primary option for CGN.",
      "ja": "複数のルーティングトポロジは、翻訳者にCGNベースの流れを導くために使用することができます。このオプションでは、MPLS / VPNオプションとしてではなく、追加の実装のオーバーヘッドとプラットフォーム構成の複雑さと同じ基本的な目標を達成するであろう。オペレータベースの翻訳は、未知のライフサイクルを持っていることが予想され、そして（オペレータのIPv4グローバル・スペースの可用性およびIPv6へのトラフィックの移行に依存して）需要の様々な程度を見ることができるので、これを有効にするには、プロバイダのための事業の大きすぎる可能性がありCGNのための彼らの主なオプション。"
    },
    {
      "indent": 0,
      "text": "4.5. Multicast Considerations",
      "section_title": true,
      "ja": "4.5。マルチキャストの注意事項"
    },
    {
      "indent": 3,
      "text": "When deploying BGP/MPLS IP VPNs as a service method for user-plane traffic to access CGN, one needs to be cognizant of current or future IP multicast requirements. User-plane IP Multicast that may originate outside of the VRF requires specific consideration. Adding the requirement for user plane IP multicast can potentially cause additional complexity related to importing and exporting the IP multicast routes in addition to suboptimal scaling and bandwidth utilization.",
      "ja": "CGNにアクセスするためのユーザプレーントラフィックのためのサービス方法として、BGP / MPLS IP VPNを展開する場合、1は、現在または将来のIPマルチキャストの要件を認識する必要があります。 VRFの外に発信するユーザプレーンIPマルチキャストは、特定の配慮が必要です。ユーザ・プレーンIPマルチキャストのための要件を追加すると、潜在的に次善のスケーリングと帯域幅の利用に加えて、IPマルチキャストルートをインポートおよびエクスポートに関連する追加の複雑さを引き起こす可能性があります。"
    },
    {
      "indent": 3,
      "text": "It is recommended to reference best practice and designs from [RFC6037], [RFC6513], and [RFC5332].",
      "ja": "[RFC6037]、[RFC6513]、および[RFC5332]からのベストプラクティスやデザインを参照することをお勧めします。"
    },
    {
      "indent": 0,
      "text": "5. Experiences",
      "section_title": true,
      "ja": "5.経験"
    },
    {
      "indent": 0,
      "text": "5.1. Basic Integration and Requirements Support",
      "section_title": true,
      "ja": "5.1。基本的な統合と要件のサポート"
    },
    {
      "indent": 3,
      "text": "The MPLS/VPN CGN environment has been successfully integrated into real network environments utilizing existing network service delivery mechanisms. It solves many issues related to provider-based translation environments while still subject to problematic behaviors inherent within NAT.",
      "ja": "MPLS / VPN CGN環境が正常に既存のネットワークサービス提供の仕組みを利用し、実際のネットワーク環境に統合されています。それは、NAT内の固有の問題行動をまだ受けながら、プロバイダベースの翻訳環境に関連する多くの問題を解決します。"
    },
    {
      "indent": 3,
      "text": "The key issues that are solved or managed with the MPLS/VPN option include:",
      "ja": "解決またはMPLS / VPNオプションを使用して管理されている重要な問題は、次のとおりです。"
    },
    {
      "indent": 3,
      "text": "- Support for the centralized and distributed deployment model",
      "ja": " - 集中型および分散型展開モデルのサポート"
    },
    {
      "indent": 3,
      "text": "- Routing plane separation for CGN flows versus traditional IPv4 flows",
      "ja": " - 従来のIPv4フローに対してCGNのルーティングプレーン分離が流れます"
    },
    {
      "indent": 3,
      "text": "- Flexible translation point design (can relocate translators and split translation zones easily)",
      "ja": " - 柔軟な翻訳・ポイント・デザイン（簡単に翻訳者とのスプリット翻訳ゾーンを再配置することができます）"
    },
    {
      "indent": 3,
      "text": "- Low maintenance overhead (dynamic routing environment with little maintenance of separate routing infrastructure other than management of MPLS/VPNs)",
      "ja": " - 低メンテナンスオーバーヘッド（MPLS / VPNの管理以外の別のルーティング・インフラストラクチャのほとんどメンテナンスと動的ルーティング環境）"
    },
    {
      "indent": 3,
      "text": "- CGN bypass options (for internal and third-party services that exist within the provider domain)",
      "ja": " - （プロバイダドメイン内に存在する内部およびサードパーティのサービスのための）CGNバイパスオプション"
    },
    {
      "indent": 3,
      "text": "- IPv4 translation realm overlap support (can reuse IP addresses between zones with some impact to extranet service model)",
      "ja": " -  IPv4の翻訳領域のオーバーラップサポート（エクストラネット・サービス・モデルにいくつかの影響とゾーン間のIPアドレスを再利用することができます）"
    },
    {
      "indent": 3,
      "text": "- Simple failover techniques can be implemented with redundant translators, such as using a second default route",
      "ja": " - 単純なフェイルオーバー技術は、第二のデフォルトルートを使用して冗長翻訳、を用いて実装することができます"
    },
    {
      "indent": 0,
      "text": "5.2. Performance",
      "section_title": true,
      "ja": "5.2。演奏"
    },
    {
      "indent": 3,
      "text": "The MPLS/VPN CGN model was observed to support basic functions that are typically used by subscribers within an operator environment. A full review of the observed impacts related to CGN (NAT444) are covered in [RFC7021].",
      "ja": "MPLS / VPN CGNモデルは、通常、オペレータ環境内の加入者によって使用されている基本的な機能をサポートすることが観察されました。 CGN（NAT444）に関する観察影響の完全なレビューは[RFC7021]で覆われています。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "An operator implementing CGN using BGP/MPLS IP VPNs should refer to Section 7 of [RFC6888] for security considerations related to CGN deployments. The operator should continue to employ the standard security methods in place for their standard MPLS deployment and can also refer to the Security Considerations section in [RFC4364], which discusses both control-plane and data-plane security.",
      "ja": "BGP / MPLS IP VPNを使用してCGNを実装するオペレータは、CGNの展開に関連するセキュリティ上の考慮事項については、[RFC6888]のセクション7を参照してください。オペレータは、その標準MPLSの展開のための場所での標準的なセキュリティ手法を採用し続けなければならないともコントロールプレーンとデータプレーンのセキュリティの両方を説明し、[RFC4364]でのセキュリティの考慮事項のセクションを参照してくださいすることができます。"
    },
    {
      "indent": 0,
      "text": "7. BGP/MPLS IP VPN CGN Framework Discussion",
      "section_title": true,
      "ja": "7. BGP / MPLS IP VPN CGN枠組みについての議論"
    },
    {
      "indent": 3,
      "text": "The MPLS/VPN delivery method for a CGN deployment is an effective and scalable way to deliver mass translation services. The architecture avoids the complex requirements of traffic engineering and policy-based routing when combining these new service flows to existing IPv4 operation. This is advantageous since the NAT444/CGN environments should be introduced with as little impact as possible, and these environments are expected to change over time.",
      "ja": "CGNの展開のためのMPLS / VPNの配信方法は、大量の翻訳サービスを提供するための効果的かつスケーラブルな方法です。これらの新しいサービスを組み合わせること既存のIPv4操作に流れたときにアーキテクチャは、トラフィックエンジニアリングおよびポリシーベースルーティングの複雑な要件を回避することができます。 NAT444 / CGN環境ができるだけ少ない影響で導入されるべきであり、これらの環境が経時的に変化することが予想されるので、これは有利です。"
    },
    {
      "indent": 3,
      "text": "The MPLS/VPN-based CGN architecture solves many of the issues related to deploying this technology in existing operator networks.",
      "ja": "MPLS / VPNベースのCGNアーキテクチャは、既存事業者のネットワークでこの技術を導入に関連する問題の多くを解決します。"
    },
    {
      "indent": 0,
      "text": "8. Acknowledgements",
      "section_title": true,
      "ja": "8.謝辞"
    },
    {
      "indent": 3,
      "text": "Thanks to the following people for their comments and feedback: Dan Wing, Chris Metz, Chris Donley, Tina TSOU, Christopher Liljenstolpe, and Tom Taylor.",
      "ja": "ダン・ウィング、クリス・メッツ、クリスDonley、ティナツオウ、クリストファーLiljenstolpe、そしてトム・テイラー：彼らのコメントやフィードバックのために以下の方々に感謝します。"
    },
    {
      "indent": 3,
      "text": "Thanks to the following people for their participation in integrating and testing the CGN environment and for their guidance in regard to IPv6 transition: Syd Alam, Richard Lawson, John E. Spence, John Jason Brzozowski, Chris Donley, Jason Weil, Lee Howard, and Jean-Francois Tremblay.",
      "ja": "CGNの環境を統合し、テストへの参加のためとIPv6への移行に関しては彼らの指導のために、次の人に感謝：シド・アラム、リチャード・ローソン、ジョン・E.スペンス、ジョン・ジェイソンBrzozowski、クリスDonley、ジェイソン・ワイル、リー・ハワード、そしてジャン=フランソワ・トレンブレイ。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "ja": "9.参考文献"
    },
    {
      "indent": 0,
      "text": "9.1. Normative Reference",
      "section_title": true,
      "ja": "9.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC4364] Rosen, E. and Y. Rekhter, \"BGP/MPLS IP Virtual Private Networks (VPNs)\", RFC 4364, February 2006.",
      "ja": "[RFC4364]ローゼン、E.およびY. Rekhter、 \"BGP / MPLS IP仮想プライベートネットワーク（VPN）\"、RFC 4364、2006年2月。"
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "ja": "9.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[CGN-DEPLOYMENTS] Donley, C., Grundemann, C., Sarawat, V., Sundaresan, K., and O. Vautrin, \"Deterministic Address Mapping to Reduce Logging in Carrier Grade NAT Deployments\", Work in Progress, January 2014.",
      "ja": "[CGN-展開] Donley、C.、Grundemann、C.、Sarawat、V.、Sundaresan、K.、およびO. Vautrin、進歩、2014年1月における作業 \"キャリアグレードNAT展開でログを削減するために決定的アドレスマッピング\" 。"
    },
    {
      "indent": 3,
      "text": "[RFC1918] Rekhter, Y., Moskowitz, R., Karrenberg, D., Groot, G., and E. Lear, \"Address Allocation for Private Internets\", BCP 5, RFC 1918, February 1996.",
      "ja": "[RFC1918] Rekhter、Y.、モスコウィッツ、R.、Karrenberg、D.、グルート、G.、およびE.リア、 \"個人的なインターネットのための配分\"、BCP 5、RFC 1918、1996年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC3031] Rosen, E., Viswanathan, A., and R. Callon, \"Multiprotocol Label Switching Architecture\", RFC 3031, January 2001.",
      "ja": "[RFC3031]ローゼン、E.、Viswanathanの、A.、およびR. Callon、 \"マルチプロトコルラベルスイッチングアーキテクチャ\"、RFC 3031、2001年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC5332] Eckert, T., Rosen, E., Aggarwal, R., and Y. Rekhter, \"MPLS Multicast Encapsulations\", RFC 5332, August 2008.",
      "ja": "[RFC5332]エッカート、T.、ローゼン、E.、アガルワル、R.、およびY. Rekhter、 \"MPLSマルチキャストカプセル化\"、RFC 5332、2008年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC6037] Rosen, E., Cai, Y., and IJ. Wijnands, \"Cisco Systems' Solution for Multicast in BGP/MPLS IP VPNs\", RFC 6037, October 2010.",
      "ja": "[RFC6037]ローゼン、E.、カイ、Y.、およびIJ。 Wijnands、 \"BGP / MPLS IP VPNのでマルチキャストのためのシスコシステムズのソリューション\"、RFC 6037、2010年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC6146] Bagnulo, M., Matthews, P., and I. van Beijnum, \"Stateful NAT64: Network Address and Protocol Translation from IPv6 Clients to IPv4 Servers\", RFC 6146, April 2011.",
      "ja": "[RFC6146] Bagnulo、M.、マシューズ、P.、およびI.バンBeijnum、 \"ステートフルNAT64：IPv4のサーバーへのIPv6クライアントからのネットワークアドレスとプロトコル変換\"、RFC 6146、2011年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC6264] Jiang, S., Guo, D., and B. Carpenter, \"An Incremental Carrier-Grade NAT (CGN) for IPv6 Transition\", RFC 6264, June 2011.",
      "ja": "[RFC6264]江、S.、郭、D.、およびB.カーペンター、 \"増分キャリアグレードNAT IPv6移行のための（CGN）\"、RFC 6264、2011年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC6333] Durand, A., Droms, R., Woodyatt, J., and Y. Lee, \"Dual-Stack Lite Broadband Deployments Following IPv4 Exhaustion\", RFC 6333, August 2011.",
      "ja": "[RFC6333]デュラン、A.、Droms、R.、Woodyatt、J.、およびY.リー、 \"IPv4の枯渇後デュアルスタックLiteのブロードバンドの展開\"、RFC 6333、2011年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC6513] Rosen, E. and R. Aggarwal, \"Multicast in MPLS/BGP IP VPNs\", RFC 6513, February 2012.",
      "ja": "[RFC6513]ローゼン、E.およびR.アガルワル、 \"MPLS / BGP VPNのIPマルチキャストで\"、RFC 6513、2012年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC6598] Weil, J., Kuarsingh, V., Donley, C., Liljenstolpe, C., and M. Azinger, \"IANA-Reserved IPv4 Prefix for Shared Address Space\", BCP 153, RFC 6598, April 2012.",
      "ja": "[RFC6598]ワイル、J.、Kuarsingh、V.、Donley、C.、Liljenstolpe、C.、およびM. Azinger、 \"IANAリザーブIPv4のプレフィックス共有アドレススペースのための\"、BCP 153、RFC 6598、2012年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC6888] Perreault, S., Yamagata, I., Miyakawa, S., Nakagawa, A., and H. Ashida, \"Common Requirements for Carrier-Grade NATs (CGNs)\", BCP 127, RFC 6888, April 2013.",
      "ja": "[RFC6888]ペロー、S.、山形、I.、宮川、S.、中川、A.、およびH.芦田、 \"キャリアグレードのNAT（CGNを）のための一般的な要件\"、BCP 127、RFC 6888、2013年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC7021] Donley, C., Howard, L., Kuarsingh, V., Berg, J., and J. Doshi, \"Assessing the Impact of Carrier-Grade NAT on Network Applications\", RFC 7021, September 2013.",
      "ja": "[RFC7021] Donley、C.、ハワード、L.、Kuarsingh、V.、ベルク、J.、およびJ.道志、 \"ネットワークアプリケーションのキャリアグレードNATの影響を評価する\"、RFC 7021、2013年9月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Victor Kuarsingh (editor) Rogers Communications 8200 Dixie Road Brampton, Ontario L6T 0C1 Canada",
      "ja": "ビクターKuarsingh（エディタ）ロジャース・コミュニケーションズ8200ディクシーロードブランプトン、オンタリオL6T 0C1カナダ"
    },
    {
      "indent": 3,
      "text": "EMail: victor@jvknet.com URI: http://www.rogers.com",
      "ja": "電子メール：victor@jvknet.com URI：http://www.rogers.com"
    },
    {
      "indent": 3,
      "text": "John Cianfarani Rogers Communications 8200 Dixie Road Brampton, Ontario L6T 0C1 Canada",
      "ja": "ジョンCianfaraniロジャース・コミュニケーションズ8200ディクシーロードブランプトン、オンタリオL6T 0C1カナダ"
    },
    {
      "indent": 3,
      "text": "EMail: john.cianfarani@rci.rogers.com URI: http://www.rogers.com",
      "ja": "電子メール：john.cianfarani@rci.rogers.com URI：http://www.rogers.com"
    }
  ]
}